#### Terraform Plan 📝`success`

<details><summary>Show Plan</summary>

```
random_string.suffix: Refreshing state... [id=XZDBPG6t]
data.aws_availability_zones.available: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["two"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["one"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["two"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["one"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["two"].data.aws_caller_identity.current: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_partition.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0291e0a58bfc08aa9]
module.eks.module.eks_managed_node_group["one"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["two"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["two"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.eks_managed_node_group["one"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/eks-testing-XZDBPG6t/cluster]
module.eks.module.eks_managed_node_group["one"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.aws_iam_role.this[0]: Refreshing state... [id=eks-testing-XZDBPG6t-cluster-20250522142856481500000003]
module.eks.module.eks_managed_node_group["two"].aws_iam_role.this[0]: Refreshing state... [id=node-group-2-eks-node-group-20250522142856481300000002]
module.eks.module.eks_managed_node_group["one"].aws_iam_role.this[0]: Refreshing state... [id=node-group-1-eks-node-group-20250522142856479700000001]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=eks-testing-XZDBPG6t-cluster-20250522142856481500000003-2025052214285712150000000a]
module.eks.module.eks_managed_node_group["one"].data.aws_caller_identity.current: Read complete after 0s [id=057756315715]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=eks-testing-XZDBPG6t-cluster-20250522142856481500000003-2025052214285712630000000b]
module.eks.data.aws_caller_identity.current: Read complete after 1s [id=057756315715]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::057756315715:user/adminuser]
module.eks.module.eks_managed_node_group["two"].data.aws_caller_identity.current: Read complete after 1s [id=057756315715]
module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=node-group-2-eks-node-group-20250522142856481300000002-20250522142857003500000007]
module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=node-group-1-eks-node-group-20250522142856479700000001-20250522142857000100000006]
module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=node-group-1-eks-node-group-20250522142856479700000001-20250522142857033600000009]
module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=node-group-2-eks-node-group-20250522142856481300000002-20250522142856938600000004]
module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=node-group-1-eks-node-group-20250522142856479700000001-20250522142856999800000005]
module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=node-group-2-eks-node-group-20250522142856481300000002-20250522142857012600000008]
data.aws_caller_identity.current: Read complete after 1s [id=057756315715]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 1s [id=057756315715]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=1171393447]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=f6168d52-59cf-4340-b771-eea5f7d049fe]
data.aws_availability_zones.available: Read complete after 1s [id=ap-southeast-3]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/eks-testing-XZDBPG6t]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::057756315715:policy/eks-testing-XZDBPG6t-cluster-ClusterEncryption20250522142922950000000015]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=eks-testing-XZDBPG6t-cluster-20250522142856481500000003-20250522142923237700000016]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-074a072272a6e046f]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0717b9d0526ba67eb]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-06a98b94b81c37da4]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0c9c25e0073100375]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-004035b9c9bd35086]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-00eb7aa305859e4c2]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03b74f1e03ca21832]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f15811a1ef397e3f]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0ba69433a756e3420]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-06ba820dc26856d04]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c61f4c8271f9aedd]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0d1b058b9d623439f]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-057980c0666e421bf]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0cbc3ba3c0a2e137c]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-00f141c3487ec8166]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-052f944cecd69b8a0]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-044e39a96cc154c47]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-01d1f88cb0fa2e467]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-06bf4df5d9b0097d7]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f15811a1ef397e3f1080289494]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1539808657]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-809439115]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-2983942674]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-2023308676]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-3084997822]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-1808073125]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-2937786475]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-189051780]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-521403163]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-258224750]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-360087005]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-078952734927383d9]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-08d687ac2ac1490a7]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-099f84de769942ffb]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0923c9c33e1249031]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-005d1beb33809821b]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-09dd7aa6fe7364956]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-03d09fbec638bce51]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-00fb7fd257ddbd7ae]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-05b12bf3c959867aa]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=eks-testing-XZDBPG6t]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0d1b058b9d623439f1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c61f4c8271f9aedd1080289494]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-057980c0666e421bf1080289494]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.time_sleep.this[0]: Refreshing state... [id=2025-05-22T14:38:02Z]
module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=eks-testing-XZDBPG6t:arn:aws:iam::057756315715:user/adminuser]
module.eks.module.eks_managed_node_group["two"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=6122142741865168292]
module.eks.module.eks_managed_node_group["one"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=278099262057957230]
module.eks.module.eks_managed_node_group["two"].aws_launch_template.this[0]: Refreshing state... [id=lt-0b09233933caddccc]
module.eks.module.eks_managed_node_group["one"].aws_launch_template.this[0]: Refreshing state... [id=lt-00f507b329a0cac8d]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=eks-testing-XZDBPG6t#arn:aws:iam::057756315715:user/adminuser#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.module.eks_managed_node_group["two"].aws_eks_node_group.this[0]: Refreshing state... [id=eks-testing-XZDBPG6t:node-group-2-2025052214381170020000001d]
module.eks.module.eks_managed_node_group["one"].aws_eks_node_group.this[0]: Refreshing state... [id=eks-testing-XZDBPG6t:node-group-1-2025052214381170000000001b]
module.eks.data.tls_certificate.this[0]: Read complete after 1s [id=fc5239dfa3a994b53f0c960d5721fa36f229efef]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::057756315715:oidc-provider/oidc.eks.ap-southeast-3.amazonaws.com/id/823098AB14AAEDEA2C70CC6AAEA01C14]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=eks-testing-XZDBPG6t:coredns]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=eks-testing-XZDBPG6t:kube-proxy]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=eks-testing-XZDBPG6t:vpc-cni]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks.aws_eks_access_entry.this["root"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "eks-testing-XZDBPG6t"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "system:masters",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::057756315715:root"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.eks.aws_iam_role.this[0],
  on .terraform/modules/eks/main.tf line 387, in resource "aws_iam_role" "this":
 387: resource "aws_iam_role" "this" {

inline_policy is deprecated. Use the aws_iam_role_policy resource instead. If
Terraform should exclusively manage all inline policy associations (the
current behavior of this argument), use the aws_iam_role_policies_exclusive
resource as well.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @akhfa, Action: `pull_request`*